MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM384FDFG/mcu.h
/* General Purpose Input_Output Port (PM) */
#define TSB_PM_DATA_PM0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,0)))
#define TSB_PM_DATA_PM1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,1)))
#define TSB_PM_CR_PM0C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR,0)))
#define TSB_PM_CR_PM1C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR,1)))
#define TSB_PM_OD_PM0OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD,0)))
#define TSB_PM_OD_PM1OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD,1)))
#define TSB_PM_PUP_PM0UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP,0)))
#define TSB_PM_PUP_PM1UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP,1)))
#define TSB_PM_PDN_PM0DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PDN,0)))
#define TSB_PM_PDN_PM1DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PDN,1)))
#define TSB_PM_IE_PM0IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE,0)))
#define TSB_PM_IE_PM1IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE,1)))


/* General Purpose Input_Output Port (PN) */
#define TSB_PN_DATA_PN0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,0)))
#define TSB_PN_DATA_PN1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,1)))
#define TSB_PN_DATA_PN2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,2)))
#define TSB_PN_DATA_PN3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,3)))
#define TSB_PN_DATA_PN4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,4)))
#define TSB_PN_DATA_PN5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,5)))
#define TSB_PN_DATA_PN6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,6)))
#define TSB_PN_DATA_PN7                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,7)))
#define TSB_PN_CR_PN0C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,0)))
#define TSB_PN_CR_PN1C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,1)))
#define TSB_PN_CR_PN2C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,2)))
#define TSB_PN_CR_PN3C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,3)))
#define TSB_PN_CR_PN4C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,4)))
#define TSB_PN_CR_PN5C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,5)))
#define TSB_PN_CR_PN6C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,6)))
#define TSB_PN_CR_PN7C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR,7)))
#define TSB_PN_FR1_PN0F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,0)))
#define TSB_PN_FR1_PN1F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,1)))
#define TSB_PN_FR1_PN2F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,2)))
#define TSB_PN_FR1_PN3F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,3)))
#define TSB_PN_FR1_PN4F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,4)))
#define TSB_PN_FR1_PN5F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,5)))
#define TSB_PN_FR1_PN6F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,6)))
#define TSB_PN_FR1_PN7F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1,7)))
#define TSB_PN_FR2_PN4F2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2,4)))
#define TSB_PN_FR2_PN5F2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2,5)))
#define TSB_PN_FR2_PN7F2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2,7)))
#define TSB_PN_OD_PN0OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,0)))
#define TSB_PN_OD_PN1OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,1)))
#define TSB_PN_OD_PN2OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,2)))
#define TSB_PN_OD_PN3OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,3)))
#define TSB_PN_OD_PN4OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,4)))
#define TSB_PN_OD_PN5OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,5)))
#define TSB_PN_OD_PN6OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,6)))
#define TSB_PN_OD_PN7OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD,7)))
#define TSB_PN_PUP_PN0UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,0)))
#define TSB_PN_PUP_PN1UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,1)))
#define TSB_PN_PUP_PN2UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,2)))
#define TSB_PN_PUP_PN3UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,3)))
#define TSB_PN_PUP_PN4UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,4)))
#define TSB_PN_PUP_PN5UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,5)))
#define TSB_PN_PUP_PN6UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,6)))
#define TSB_PN_PUP_PN7UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP,7)))
#define TSB_PN_PDN_PN0DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,0)))
#define TSB_PN_PDN_PN1DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,1)))
#define TSB_PN_PDN_PN2DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,2)))
#define TSB_PN_PDN_PN3DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,3)))
#define TSB_PN_PDN_PN4DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,4)))
#define TSB_PN_PDN_PN5DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,5)))
#define TSB_PN_PDN_PN6DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,6)))
#define TSB_PN_PDN_PN7DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PDN,7)))
#define TSB_PN_IE_PN0IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,0)))
#define TSB_PN_IE_PN1IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,1)))
#define TSB_PN_IE_PN2IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,2)))
#define TSB_PN_IE_PN3IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,3)))
#define TSB_PN_IE_PN4IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,4)))
#define TSB_PN_IE_PN5IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,5)))
#define TSB_PN_IE_PN6IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,6)))
#define TSB_PN_IE_PN7IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE,7)))


/* General Purpose Input_Output Port (PP) */
#define TSB_PP_DATA_PP0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,0)))
#define TSB_PP_DATA_PP1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,1)))
#define TSB_PP_CR_PP0C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR,0)))
#define TSB_PP_CR_PP1C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR,1)))
#define TSB_PP_OD_PP0OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD,0)))
#define TSB_PP_OD_PP1OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD,1)))
#define TSB_PP_PUP_PP0UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP,0)))
#define TSB_PP_PUP_PP1UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP,1)))
#define TSB_PP_PDN_PP0DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PDN,0)))
#define TSB_PP_PDN_PP1DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PDN,1)))
#define TSB_PP_IE_PP0IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE,0)))
#define TSB_PP_IE_PP1IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE,1)))


/* General Purpose Input_Output Port (PQ) */
#define TSB_PQ_DATA_PQ0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->DATA,0)))
#define TSB_PQ_DATA_PQ1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->DATA,1)))
#define TSB_PQ_DATA_PQ2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->DATA,2)))
#define TSB_PQ_DATA_PQ3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->DATA,3)))
#define TSB_PQ_CR_PQ0C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->CR,0)))
#define TSB_PQ_CR_PQ1C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->CR,1)))
#define TSB_PQ_CR_PQ2C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->CR,2)))
#define TSB_PQ_CR_PQ3C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->CR,3)))
#define TSB_PQ_OD_PQ0OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->OD,0)))
#define TSB_PQ_OD_PQ1OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->OD,1)))
#define TSB_PQ_OD_PQ2OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->OD,2)))
#define TSB_PQ_OD_PQ3OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->OD,3)))
#define TSB_PQ_PUP_PQ0UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PUP,0)))
#define TSB_PQ_PUP_PQ1UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PUP,1)))
#define TSB_PQ_PUP_PQ2UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PUP,2)))
#define TSB_PQ_PUP_PQ3UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PUP,3)))
#define TSB_PQ_PDN_PQ0DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PDN,0)))
#define TSB_PQ_PDN_PQ1DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PDN,1)))
#define TSB_PQ_PDN_PQ2DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PDN,2)))
#define TSB_PQ_PDN_PQ3DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->PDN,3)))
#define TSB_PQ_IE_PQ0IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->IE,0)))
#define TSB_PQ_IE_PQ1IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->IE,1)))
#define TSB_PQ_IE_PQ2IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->IE,2)))
#define TSB_PQ_IE_PQ3IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PQ->IE,3)))


/* General Purpose Input_Output Port (PR) */
#define TSB_PR_DATA_PR0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,0)))
#define TSB_PR_DATA_PR1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,1)))
#define TSB_PR_DATA_PR2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,2)))
#define TSB_PR_DATA_PR3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,3)))
#define TSB_PR_DATA_PR4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,4)))
#define TSB_PR_DATA_PR5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,5)))
#define TSB_PR_DATA_PR6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,6)))
#define TSB_PR_DATA_PR7                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->DATA,7)))
#define TSB_PR_CR_PR0C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,0)))
#define TSB_PR_CR_PR1C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,1)))
#define TSB_PR_CR_PR2C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,2)))
#define TSB_PR_CR_PR3C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,3)))
#define TSB_PR_CR_PR4C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,4)))
#define TSB_PR_CR_PR5C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,5)))
#define TSB_PR_CR_PR6C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,6)))
#define TSB_PR_CR_PR7C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->CR,7)))
#define TSB_PR_FR1_PR0F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,0)))
#define TSB_PR_FR1_PR1F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,1)))
#define TSB_PR_FR1_PR2F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,2)))
#define TSB_PR_FR1_PR3F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,3)))
#define TSB_PR_FR1_PR4F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,4)))
#define TSB_PR_FR1_PR5F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,5)))
#define TSB_PR_FR1_PR6F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,6)))
#define TSB_PR_FR1_PR7F1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR1,7)))
#define TSB_PR_FR2_PR4F2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR2,4)))
#define TSB_PR_FR2_PR5F2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->FR2,5)))
#define TSB_PR_OD_PQ0OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,0)))
#define TSB_PR_OD_PQ1OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,1)))
#define TSB_PR_OD_PQ2OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,2)))
#define TSB_PR_OD_PQ3OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,3)))
#define TSB_PR_OD_PQ4OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,4)))
#define TSB_PR_OD_PQ5OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,5)))
#define TSB_PR_OD_PQ6OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,6)))
#define TSB_PR_OD_PQ7OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->OD,7)))
#define TSB_PR_PUP_PQ0UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,0)))
#define TSB_PR_PUP_PQ1UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,1)))
#define TSB_PR_PUP_PQ2UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,2)))
#define TSB_PR_PUP_PQ3UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,3)))
#define TSB_PR_PUP_PQ4UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,4)))
#define TSB_PR_PUP_PQ5UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,5)))
#define TSB_PR_PUP_PQ6UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,6)))
#define TSB_PR_PUP_PQ7UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PUP,7)))
#define TSB_PR_PDN_PQ0DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,0)))
#define TSB_PR_PDN_PQ1DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,1)))
#define TSB_PR_PDN_PQ2DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,2)))
#define TSB_PR_PDN_PQ3DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,3)))
#define TSB_PR_PDN_PQ4DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,4)))
#define TSB_PR_PDN_PQ5DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,5)))
#define TSB_PR_PDN_PQ6DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,6)))
#define TSB_PR_PDN_PQ7DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->PDN,7)))
#define TSB_PR_IE_PQ0IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,0)))
#define TSB_PR_IE_PQ1IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,1)))
#define TSB_PR_IE_PQ2IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,2)))
#define TSB_PR_IE_PQ3IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,3)))
#define TSB_PR_IE_PQ4IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,4)))
#define TSB_PR_IE_PQ5IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,5)))
#define TSB_PR_IE_PQ6IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,6)))
#define TSB_PR_IE_PQ7IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PR->IE,7)))


/* General Purpose Input_Output Port (PS) */
#define TSB_PS_DATA_PS0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,0)))
#define TSB_PS_DATA_PS1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,1)))
#define TSB_PS_DATA_PS2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,2)))
#define TSB_PS_DATA_PS3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,3)))
#define TSB_PS_DATA_PS4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,4)))
#define TSB_PS_DATA_PS5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,5)))
#define TSB_PS_DATA_PS6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->DATA,6)))
#define TSB_PS_CR_PS0C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,0)))
#define TSB_PS_CR_PS1C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,1)))
#define TSB_PS_CR_PS2C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,2)))
#define TSB_PS_CR_PS3C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,3)))
#define TSB_PS_CR_PS4C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,4)))
#define TSB_PS_CR_PS5C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,5)))
#define TSB_PS_CR_PS6C                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->CR,6)))
#define TSB_PS_OD_PS0OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,0)))
#define TSB_PS_OD_PS1OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,1)))
#define TSB_PS_OD_PS2OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,2)))
#define TSB_PS_OD_PS3OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,3)))
#define TSB_PS_OD_PS4OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,4)))
#define TSB_PS_OD_PS5OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,5)))
#define TSB_PS_OD_PS6OD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->OD,6)))
#define TSB_PS_PUP_PS0UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,0)))
#define TSB_PS_PUP_PS1UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,1)))
#define TSB_PS_PUP_PS2UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,2)))
#define TSB_PS_PUP_PS3UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,3)))
#define TSB_PS_PUP_PS4UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,4)))
#define TSB_PS_PUP_PS5UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,5)))
#define TSB_PS_PUP_PS6UP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PUP,6)))
#define TSB_PS_PDN_PS0DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,0)))
#define TSB_PS_PDN_PS1DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,1)))
#define TSB_PS_PDN_PS2DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,2)))
#define TSB_PS_PDN_PS3DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,3)))
#define TSB_PS_PDN_PS4DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,4)))
#define TSB_PS_PDN_PS5DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,5)))
#define TSB_PS_PDN_PS6DN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->PDN,6)))
#define TSB_PS_IE_PS0IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,0)))
#define TSB_PS_IE_PS1IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,1)))
#define TSB_PS_IE_PS2IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,2)))
#define TSB_PS_IE_PS3IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,3)))
#define TSB_PS_IE_PS4IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,4)))
#define TSB_PS_IE_PS5IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,5)))
#define TSB_PS_IE_PS6IE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PS->IE,6)))


